/*!
  \brief Функция регистрации
  Функция регистрации, позволяющая работнику компании зарегистрироваться в системе
  \param [in] login  Логин пользователя
  \param [in] email  E-mail пользователя
  \param [in] password  Пароль пользователя
*/
singUp(login, email, password) {}
/*!
  \brief Функция входа
  Функция входа, позволяющая работнику компании войти в систему
  \warning Может войти только зарегистрированный пользователь
  \param [in] login  Логин пользователя
  \param [in] password  Пароль пользователя
*/
singIn(login, password) {}
/*!
  \brief Функция создания заявки
  Функция создания заявки, позволяющая работнику компании создать заявку
  \warning Может создать только авторизированный пользователь
  \param [in] idUser  Id пользователя
*/
createBid(idUser) {}
/*!
  \brief Функция удаления заявки
  Функция удаления заявки, позволяющая работнику компании удалить заявку
  \warning Может удалить только пользователь соответвующей роли
  \param [in] idUser  Id пользователя
*/
delBid(idUser) {}
/*!
  \brief Функция передачи заявки
  Функция передачи заявки, позволяющая работнику компании передать заявку
  \param [in] loginFrom  Логин пользователя от которого передается заявка
  \param [in] loginTo  Логин пользователя которому передается заявка
  \param [in] idBid  Id заявки
*/
conveyBid(loginFrom, loginTo, idBid) {}
/*!
  \brief Функция редактироания заявки
  Функция редактирвоания заявки, позволяющая работнику компании редактировать заявку
  \param [in] idBid  Id заявки
  \param [in] idUser  Id пользователя
*/
editBid(idBid, idUser) {}
/*!
  \brief Функция сохранения заявки
  Функция сохранения заявки, позволяющая работнику компании сохранить заявку
  \param [in] idBid  Id заявки
  \param [in] idUser  Id пользователя
*/
saveChanges(idBid, idUser) {}
/*!
  \brief Функция выхода
  Функция выхода, позволяющая пользователю выйти из системы
  \param [in] idUser  Id пользователя
*/
signOut(idUser) {}
/*!
  \brief Функция закрытия заявки
  Функция закрытия заявки, позволяющая работнику компании закрыть заявку
  \param [in] idUser  Id пользователя
  \param [in] idClient  Id клиента
*/
closeBid(idUser, idClient) {}
/*!
  \brief Функция проверки роли
  Функция проверки роли, позволяющая проверить роль пользователя
  \param [in] idUser  Id пользователя
*/
checkRole(idUser) {}